Repository: elektron-BG96/xOPS-App
Catalog: Saplin.xOPS.UI/Localization/L11ns.*.resx
Languages: ru

# About
source: The app calculates how many operations (load number, add, subtract, multiply, divide, compare) a CPU can perform in a given second with either fractional (floating-point) or integer numbers: • FLOPS - Floating-point Operations Per Second, performance measurement of Floating Point Unit (FPU). • INOPS - Integer Operations Per Second, measurement of Arithmetic logic unit (ALU) E.g. 1 GigaFLOPS means that CPU can do 1 billion floating-point operations per second (such as 1.1+2.2=3.3). These operations are essentially what CPUs do all the time while running apps. General app logic is typically reliant on integer operations, while graphics and games rely on floating-point ones. The faster your CPU can crunch numbers, the faster your apps can run. Both FPU and ALU tests are executed in single and multithreaded modes and reflect both multi-core and single-core performance of the CPU . The tests are "isolated", meaning that they focus on creating CPU load only (and it's FPU and ALU) while trying to cross out interferences from other pieces of the system (such as memory, cache, storage, network, software optimizations etc.). There're many factors determining systems' performance and CPU although the major one is not the only. While the app doesn’t give a single simple answer (or score) to the questions "How fast is the phone/laptop/PC?" (is it even possible?), it gives a comparable performance metric of one important piece of your device - the CPU. The app is cross platform (supports Android/ChromeOS, Windows, macOS): LINKS
ru: Приложение измеряет сколько операций (сложение, вычитание, умножение, деление, сравнение и т.п.) может выполнить центральный процессор (ЦП) над дробными (floating-point) и целыми (integer) числами: • FLOPS (Floating-point Operations Per Second) - количество операций с дробными числами в секунду, измерение производительности математического сопроцессора (Floating Point Unit, FPU). • INOPS (Integer Operations Per Second) - количество операций с целыми числами в секунду, измерение производительности арифметико-логического устройства (Arithmetic logic unit, ALU) Например 1 G(iga)FLOPS означает, что процессор способен произвести 1 миллиард операций с дробными числами (такими как 1.1+2.2=3.3). Основная логика приложения зачастую построена на целочисленных вычислений. Графические задачи и игры полагаются на дробные вычисления. И АЛУ и математический сопроцессор тестируются как в однопоточном, так и многопоточном режиме, что отражает производительность одно и многоядерных режимов работы процессора. Тесты "изолированные", что означает что они нагружают исключительно центральный процессор игнорируя иные компоненты вычислительной системы (память, кэш, хранилище, сеть, оптимизации ПО). Существует множество факторов, определяющих производительность, и хоть процессов один из важнейших, он не является единственным. Приложение не пытается дать простой ответ на сложный вопрос "Насколько быстр мой телефон/ноутбук/компьютер?". Однако оно дает оценку одного важного компонента вашего устройства - процессора. Узнать больще о приложении и скачать версии для других ОС (Android/ChromeOS, Windows, macOS) можно по ссылке:

source: Options
ru: Опции

source: Close
ru: Закрыть

# CountdownMany
source: Starting in {0} seconds
ru: Запуск через {0} секунды

# CountdownOne
source: Starting in 1 second
ru: Запуск через 1 секунду

source: Floating
ru: Дробные

source: Integer
ru: Целые

# ST
source: Single Threaded
ru: Однопоточный

# MT
source: Multi Threaded
ru: Многопоточный

# Break
source: ¾ Break
ru: ¾ Стоп

source: ↻ Retry
ru: ↻ Повтор

source: ↪ Share
ru: ↪ Выслать

source: Running...
ru: Тестирование...

source: Test interrupted
ru: Тест прерван

source: Precision
ru: Точность

source: Threads Number
ru: Число потоков

source: Bit
ru: бита

# AveragesMany
source: Showing averages, {0} tests
ru: {0} тестов, средние

# AveragesOne
source: 1 test
ru: 1 тест
